Revit 2027 API
ExternalDefinitionCreationOptions.UserModifiable Property
 This property indicates whether this parameter can be modified by UI user or not.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool UserModifiable { get; set; }
Public Property UserModifiable As Boolean
	Get
	Set
public:
property bool UserModifiable {
	bool get ();
	void set (bool value);
}
member UserModifiable : bool with get, set
Property Value
Boolean
 True if the parameter will be modifiable by the user in the user interface, false if the parameter will display as read-only. The default is true.
See Also
Reference
ExternalDefinitionCreationOptions Class
Autodesk.Revit.DB Namespace